RT-Thread/rt-thread/bsp/hc32l196/Libraries/HC32L196_StdPeriph_Driver/src/hc32l196_timer3.c
    M0P_TIM3_MODE0->M0CR_f.UIE = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 中断使能(模式1)
 **
 **
 ** \param [in]  enTim3Irq           中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode1_EnableIrq (en_tim3_irq_type_t enTim3Irq)
{
    en_result_t enResult = Ok;


    switch (enTim3Irq)
    {
        case Tim3UevIrq:
            M0P_TIM3_MODE1->M1CR_f.UIE = TRUE;
            break;
        case Tim3CA0Irq:
            M0P_TIM3_MODE1->CR0_f.CIEA = TRUE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 中断禁止(模式1)
 **
 **
 ** \param [in]  enTim3Irq           中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode1_DisableIrq (en_tim3_irq_type_t enTim3Irq)
{
    en_result_t enResult = Ok;


    switch (enTim3Irq)
    {
        case Tim3UevIrq:
            M0P_TIM3_MODE1->M1CR_f.UIE = FALSE;
            break;
        case Tim3CA0Irq:
            M0P_TIM3_MODE1->CR0_f.CIEA = FALSE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 中断使能(模式23)
 **
 **
 ** \param [in]  enTim3Irq           中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode23_EnableIrq (en_tim3_irq_type_t enTim3Irq)
{
    en_result_t enResult = Ok;


    switch (enTim3Irq)
    {
        case Tim3UevIrq:
            M0P_TIM3_MODE23->M23CR_f.UIE = TRUE;
            break;
        case Tim3CA0Irq:
            M0P_TIM3_MODE23->CRCH0_f.CIEA = TRUE;
            break;
        case Tim3CB0Irq:
            M0P_TIM3_MODE23->CRCH0_f.CIEB = TRUE;
            break;
        case Tim3CA1Irq:
            M0P_TIM3_MODE23->CRCH1_f.CIEA = TRUE;
            break;
        case Tim3CB1Irq:
            M0P_TIM3_MODE23->CRCH1_f.CIEB = TRUE;
            break;
        case Tim3CA2Irq:
            M0P_TIM3_MODE23->CRCH2_f.CIEA = TRUE;
            break;
        case Tim3CB2Irq:
            M0P_TIM3_MODE23->CRCH2_f.CIEB = TRUE;
            break;
        case Tim3BkIrq:
            M0P_TIM3_MODE23->M23CR_f.BIE = TRUE;
            break;
        case Tim3TrigIrq:
            M0P_TIM3_MODE23->M23CR_f.TIE = TRUE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 中断禁止(模式23)
 **
 **
 ** \param [in]  enTim3Irq           中断类型
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode23_DisableIrq (en_tim3_irq_type_t enTim3Irq)
{
    en_result_t enResult = Ok;


    switch (enTim3Irq)
    {
        case Tim3UevIrq:
            M0P_TIM3_MODE23->M23CR_f.UIE = FALSE;
            break;
        case Tim3CA0Irq:
            M0P_TIM3_MODE23->CRCH0_f.CIEA = FALSE;
            break;
        case Tim3CB0Irq:
            M0P_TIM3_MODE23->CRCH0_f.CIEB = FALSE;
            break;
        case Tim3CA1Irq:
            M0P_TIM3_MODE23->CRCH1_f.CIEA = FALSE;
            break;
        case Tim3CB1Irq:
            M0P_TIM3_MODE23->CRCH1_f.CIEB = FALSE;
            break;
        case Tim3CA2Irq:
            M0P_TIM3_MODE23->CRCH2_f.CIEA = FALSE;
            break;
        case Tim3CB2Irq:
            M0P_TIM3_MODE23->CRCH2_f.CIEB = FALSE;
            break;
        case Tim3BkIrq:
            M0P_TIM3_MODE23->M23CR_f.BIE = FALSE;
            break;
        case Tim3TrigIrq:
            M0P_TIM3_MODE23->M23CR_f.TIE = FALSE;
            break;
        default:
            enResult = Error;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 初始化配置(模式0)
 **
 **
 ** \param [in]  pstcCfg       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode0_Init(stc_tim3_mode0_cfg_t* pstcCfg)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->M0CR_f.MODE   = pstcCfg->enWorkMode;
    M0P_TIM3_MODE0->M0CR_f.GATEP  = pstcCfg->enGateP;
    M0P_TIM3_MODE0->M0CR_f.GATE   = pstcCfg->bEnGate;
    M0P_TIM3_MODE0->M0CR_f.PRS    = pstcCfg->enPRS;
    M0P_TIM3_MODE0->M0CR_f.TOGEN  = pstcCfg->bEnTog;
    M0P_TIM3_MODE0->M0CR_f.CT     = pstcCfg->enCT;
    M0P_TIM3_MODE0->M0CR_f.MD     = pstcCfg->enCntMode;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 启动运行(模式0)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_Run(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->M0CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 停止运行(模式0)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_Stop(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->M0CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 端口输出使能/禁止设定(模式0)
 **
 **
 ** \param [in]  bEnOutput          翻转输出设定 TRUE:使能, FALSE:禁止
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_Enable_Output(boolean_t bEnOutput)
{
    en_result_t enResult = Ok;


    M0P_TIM3_MODE0->DTR_f.MOE = bEnOutput;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 翻转使能/禁止（低电平）设定(模式0)
 **
 **
 ** \param [in]  bEnTOG          翻转输出设定 TRUE:使能, FALSE:禁止
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_EnTOG(boolean_t bEnTOG)
{
    en_result_t enResult = Ok;

