RT-Thread/rt-thread/bsp/hc32l196/Libraries/HC32L196_StdPeriph_Driver/src/hc32l196_timer3.c
    M0P_TIM3_MODE0->M0CR_f.TOGEN = bEnTOG;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数器初值设置(模式0)
 **
 **
 ** \param [in]  u16Data          CNT 16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_Cnt16Set(uint16_t u16Data)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->CNT_f.CNT = u16Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数值获取(模式0)
 **
 **
 ** \param [in]  none
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Tim3_M0_Cnt16Get(void)
{
    uint16_t    u16CntData = 0;

    u16CntData = M0P_TIM3_MODE0->CNT_f.CNT;

    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Timer3 重载值设置(模式0)
 **
 **
 ** \param [in]  u16Data          16bits重载值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_ARRSet(uint16_t u16Data)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->ARR_f.ARR = u16Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 32位计数器初值设置(模式0)
 **
 **
 ** \param [in]  u32Data          32位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M0_Cnt32Set(uint32_t u32Data)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE0->CNT32_f.CNT32 = u32Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 32位计数值获取(模式0)
 **
 **
 ** \param [in]  none
 **
 ** \retval 32bits计数值
 *****************************************************************************/
uint32_t Tim3_M0_Cnt32Get(void)
{
    uint32_t    u32CntData = 0;

    u32CntData = M0P_TIM3_MODE0->CNT32_f.CNT32;

    return u32CntData;
}

/**
 *****************************************************************************
 ** \brief Timer3 初始化配置(模式1)
 **
 **
 ** \param [in]  pstcCfg       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode1_Init(stc_tim3_mode1_cfg_t* pstcCfg)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE1->M1CR_f.MODE    = pstcCfg->enWorkMode;
    M0P_TIM3_MODE1->M1CR_f.PRS     = pstcCfg->enPRS;
    M0P_TIM3_MODE1->M1CR_f.CT      = pstcCfg->enCT;
    M0P_TIM3_MODE1->M1CR_f.ONESHOT = pstcCfg->enOneShot;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 PWC 输入配置(模式1)
 **
 **
 ** \param [in]  pstcCfg       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M1_Input_Cfg(stc_tim3_pwc_input_cfg_t* pstcCfg)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE1->MSCR_f.TS    = pstcCfg->enTsSel;
    M0P_TIM3_MODE1->MSCR_f.IA0S  = pstcCfg->enIA0Sel;
    M0P_TIM3_MODE1->MSCR_f.IB0S  = pstcCfg->enIB0Sel;
    M0P_TIM3_MODE1->FLTR_f.ETP   = pstcCfg->enETRPhase;
    M0P_TIM3_MODE1->FLTR_f.FLTET = pstcCfg->enFltETR;
    M0P_TIM3_MODE1->FLTR_f.FLTA0 = pstcCfg->enFltIA0;
    M0P_TIM3_MODE1->FLTR_f.FLTB0 = pstcCfg->enFltIB0;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 PWC测量边沿起始结束选择(模式1)
 **
 **
 ** \param [in]  enEdgeSel           pwc测量起始终止电平
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M1_PWC_Edge_Sel(en_tim3_m1cr_Edge_t enEdgeSel)
{
    en_result_t enResult = Ok;

    switch (enEdgeSel)
    {
        case 0:                                 ///< 上升沿到上升沿(周期)
            M0P_TIM3_MODE1->M1CR_f.EDG1ST = 0;  //上升沿
            M0P_TIM3_MODE1->M1CR_f.EDG2ND = 0;  //上升沿
            break;
        case 1:                                 ///< 下降沿到上升沿(低电平)
            M0P_TIM3_MODE1->M1CR_f.EDG1ST = 1;  //下降沿
            M0P_TIM3_MODE1->M1CR_f.EDG2ND = 0;  //上升沿
            break;
        case 2:                                 ///< 上升沿到下降沿(高电平)
            M0P_TIM3_MODE1->M1CR_f.EDG1ST = 0;  //上升沿
            M0P_TIM3_MODE1->M1CR_f.EDG2ND = 1;  //下降沿
            break;
        case 3:                                 ///< 下降沿到下降沿(周期)
            M0P_TIM3_MODE1->M1CR_f.EDG1ST = 1;  //下降沿
            M0P_TIM3_MODE1->M1CR_f.EDG2ND = 1;  //下降沿
            break;
        default:
            ;
            break;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 启动运行(模式1)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M1_Run(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE1->M1CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 停止运行(模式1)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M1_Stop(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE1->M1CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数器初值设置(模式1)
 **
 **
 ** \param [in]  u16Data          16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M1_Cnt16Set(uint16_t u16Data)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE1->CNT_f.CNT = u16Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数值获取(模式1)
 **
 **
 ** \param [in]  none
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Tim3_M1_Cnt16Get(void)
{
    uint16_t    u16CntData = 0;

    u16CntData = M0P_TIM3_MODE1->CNT_f.CNT;

