RT-Thread/rt-thread/bsp/hc32l196/Libraries/HC32L196_StdPeriph_Driver/src/hc32l196_timer3.c
    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Timer3 脉冲宽度测量结果数值获取(模式1)
 **
 **
 ** \param [in]  none
 **
 ** \retval 16bits脉冲宽度测量结果
 *****************************************************************************/
uint16_t Tim3_M1_PWC_CapValueGet(void)
{
    uint16_t    u16CapData = 0;

    u16CapData = M0P_TIM3_MODE1->CCR0A_f.CCR0A;

    return u16CapData;
}

/**
 *****************************************************************************
 ** \brief Timer3 初始化配置(模式23)
 **
 **
 ** \param [in]  pstcCfg       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_Mode23_Init(stc_tim3_mode23_cfg_t* pstcCfg)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE23->M23CR_f.MODE    = pstcCfg->enWorkMode;

    M0P_TIM3_MODE23->M23CR_f.PRS     = pstcCfg->enPRS;
    M0P_TIM3_MODE23->M23CR_f.CT      = pstcCfg->enCT;
    M0P_TIM3_MODE23->M23CR_f.COMP    = pstcCfg->enPWMTypeSel;
    M0P_TIM3_MODE23->M23CR_f.PWM2S   = pstcCfg->enPWM2sSel;
    M0P_TIM3_MODE23->M23CR_f.ONESHOT = pstcCfg->bOneShot;
    M0P_TIM3_MODE23->M23CR_f.URS     = pstcCfg->bURSSel;
    M0P_TIM3_MODE23->M23CR_f.DIR     = pstcCfg->enCntDir;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 PWM输出使能(模式23)
 **
 **
 ** \param [in]  bEnOutput          PWM输出使能/禁止设定
 ** \param [in]  bEnAutoOutput      PWM自动输出使能/禁止设定
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_EnPWM_Output(boolean_t bEnOutput, boolean_t bEnAutoOutput)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE23->DTR_f.MOE = bEnOutput;
    M0P_TIM3_MODE23->DTR_f.AOE = bEnAutoOutput;

    return enResult;
}


/**
 *****************************************************************************
 ** \brief Timer3 启动运行(模式23)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_Run(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE23->M23CR_f.CTEN = TRUE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 停止运行(模式23)
 **
 **
 ** \param [in]  none
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_Stop(void)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE23->M23CR_f.CTEN = FALSE;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 重载值设置(模式23)
 **
 **
 ** \param [in]  u16Data          16bits重载值
 ** \param [in]  bArrBufEn        ARR重载缓存使能TRUE/禁止FALSE
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_ARRSet(uint16_t u16Data, boolean_t bArrBufEn)
{
    en_result_t enResult = Ok;

     M0P_TIM3_MODE23->ARR_f.ARR       = u16Data;
     M0P_TIM3_MODE23->M23CR_f.BUFPEN  = bArrBufEn;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数器初值设置(模式23)
 **
 **
 ** \param [in]  u16Data          16位初值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_Cnt16Set(uint16_t u16Data)
{
    en_result_t enResult = Ok;

    M0P_TIM3_MODE23->CNT_f.CNT = u16Data;

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 16位计数值获取(模式23)
 **
 **
 ** \param [in]  none
 **
 ** \retval 16bits计数值
 *****************************************************************************/
uint16_t Tim3_M23_Cnt16Get(void)
{
    uint16_t    u16CntData = 0;

    u16CntData = M0P_TIM3_MODE23->CNT_f.CNT;

    return u16CntData;
}

/**
 *****************************************************************************
 ** \brief Timer3 比较捕获寄存器CCRxA/CCRxB设置(模式23)
 **
 **
 ** \param [in]  enCCRSel           CCRxA/CCRxB设定
 ** \param [in]  u16Data            CCRxA/CCRxB 16位初始值
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_CCR_Set(en_tim3_m23_ccrx_t enCCRSel, uint16_t u16Data)
{
    en_result_t enResult = Ok;

    if(Tim3CCR0A == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR0A_f.CCR0A = u16Data;
    }
    else if(Tim3CCR0B == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR0B_f.CCR0B = u16Data;
    }
    else if(Tim3CCR1A == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR1A_f.CCR1A = u16Data;
    }
    else if(Tim3CCR1B == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR1B_f.CCR1B = u16Data;
    }
    else if(Tim3CCR2A == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR2A_f.CCR2A = u16Data;
    }
    else if(Tim3CCR2B == enCCRSel)
    {
        M0P_TIM3_MODE23->CCR2B_f.CCR2B = u16Data;
    }
    else
    {
        enResult = Error;
    }

    return enResult;
}

/**
 *****************************************************************************
 ** \brief Timer3 比较捕获寄存器CCRxA/CCRxB读取(模式23)
 **
 **
 ** \param [in]  enCCRSel           CCRxA/CCRxB设定
 **
 ** \retval 16bitsCCRxA/CCRxB捕获值
 *****************************************************************************/
uint16_t Tim3_M23_CCR_Get(en_tim3_m23_ccrx_t enCCRSel)
{
    uint16_t    u16Data = 0;

    if(Tim3CCR0A == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR0A_f.CCR0A;
    }
    else if(Tim3CCR0B == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR0B_f.CCR0B;
    }
    else if(Tim3CCR1A == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR1A_f.CCR1A;
    }
    else if(Tim3CCR1B == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR1B_f.CCR1B;
    }
    else if(Tim3CCR2A == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR2A_f.CCR2A;
    }
    else if(Tim3CCR2B == enCCRSel)
    {
        u16Data = M0P_TIM3_MODE23->CCR2B_f.CCR2B;
    }
    else
    {
        u16Data = 0;
    }

    return u16Data;
}

/**
 *****************************************************************************
 ** \brief Timer3 PWM互补输出模式下，GATE功能选择(模式23)
 **
 **
 ** \param [in]  pstcCfg       初始化配置结构体指针
 **
 ** \retval Ok or Error
 *****************************************************************************/
en_result_t Tim3_M23_GateFuncSel(stc_tim3_m23_gate_cfg_t* pstcCfg)
{
    en_result_t enResult = Ok;

